app/controllers/tweets_controller.rb

  def index
   @tweets = Tweet.includes(:user).page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 3 ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)

  def create
    Tweet.create(name: tweet_params[:name], text: tweet_params[:text], user_id: current_user.id)
---
INSERT INTO `tweets` (`name`, `text`, `image`, `created_at`, `updated_at`, `user_id`) VALUES ('ぽぽぽ', '鬱苦ぢいいいいいい', 'https://wondertrip.jp/wp-content/uploads/2016/02/f16-14.jpg', '2018-12-24 06:04:07', '2018-12-24 06:04:07', 1)

    def destroy
      tweet = Tweet.find(params[:id])
      if tweet.user_id == current_user.id
        tweet.destroy
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 13 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 13

    def edit
      @tweet = Tweet.find(params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1

    def update
     tweet = Tweet.find(params[:id])
      if tweet.user_id == current_user.id
        tweet.update(tweet_params)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
UPDATE `tweets` SET `text` = 'プリン食べたい', `updated_at` = '2018-12-25 03:44:35' WHERE `tweets`.`id` = 12

  def show
    @tweet = Tweet.find(params[:id])
    @comments = @tweet.comments.includes(:user)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 12
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 14 LIMIT 1